Updated: Further readme updates
